package com.green.java.ch06;

public class ObjectStudy1 {
    public static void main(String[] args) {
        //클래스 (class) > 붕어빵틀, 설계도
        // 객체 (object) > (인스턴스, Instance) 붕어빵, 클래스로 만들 실체
        //메모리에 올라가서 동작할 수 있으면 실체라고 할 수 있다.
        //객체 2가지 구성요소 : 멤버필드(변수, 상수)(속성), 멤버메소드
        //멤버핃드 명사 담당, 값 저장 가능
        //멤버메소드 동사 담당, 동작 담당
        //e.g. 게임 캐릭터, 멤버필드 > 직업, 이름, 레벨, hp, mp, 스테미나
        //               멤버메소드 > 이동한다, 아이템을 줍고 버린다, 공격한다

        //Method(메소드), Function(함수)
        //객체안에 존재하면 메소드 ,자바는 무조건 객체 안에 적어야해서 메소드
        //객체밖에 존재하면 함수


    }
}
